<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"6c00615707417ca908a5020f6d084f9d9989cadb5f7227236abce782a85c4626","plan_job_ref":"Job .github/workflows/_test-tf.yaml #143 at https://github.com/DND-IT/github-workflows/actions/runs/18790923006","plan_out_hash":"603b6cad3eef367df7ba749b994c3ee4b62d5ac5e09128515acae6757154f3c0","plan_hash":"77af22be2bb68ad63920f813ace52ee8dba7e351e906949671719ea1dfd42d95","plan_text_format":"diff","version":"2.2.2"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #143](https://github.com/DND-IT/github-workflows/actions/runs/18790923006)